/* State and Keywordgroupnames */
"Strings in Tags" = "\"Zeichenketten in Tags\"";
"Attributes in Tags" = "Attribute in Tags";
"Entities" = "HTML Entities";
"Tags" = "Tags";
"Comment" = "<!-- Kommentar -->";
"Escape" = "<?Prolog?>";
"Inline CSS" = "Inline CSS";
"CSS Strings in Tags" = "CSS Zeichenketten in Tags";
"CSS Attributes in Tags" = "CSS Attribute in Tags";
"CSS Begin and End" = "CSS Begin und Ende";
"Inline Javascript" = "Inline Javascript";
"Opening Script Tag" = "Javascript Begin and End";
"ERB Delimiter" = "<%ERB Delimiter%>";
"Ruby" = "Ruby Code";
"SGML Double Dash" = "SGML Kommentar Warnung";
"CDATA" = "<![CDATA[...]]>";
"Doctype" = "<!Deklaration>";
"Escape" = "<?Prolog?>";
"Style Tags" = "Style Tags";
"Opening Style Tag" = "Öffnendes Style Tag";
"Inside curly brackets" = "{CSS Blöcke}";
"CSSComment" = "/* CSS Kommentar */";
"CSSSingleComment" = "// CSS Kommentar";
"CSSRound bracket" = "(CSS in Klammern)";
"CSSString" = "\"CSS Zeichenketten\"";
"CSSSingleString" = "'CSS Zeichenketten'";
"Inline CSS" = "Inline CSS";
"Script Tags" = "Script Tags";
"Opening Script Tag" = "Öffnendes Script Tag";
"JSAutodocComment" = "/*\" Javascript Kommentar \"*/";
"JSComment" = "/* Javascript Kommentar */";
"JSSingleComment" = "// Javascript Kommentar";
"JSRegEx" = "Javascript Regular Expressions";
"JSString" = "\"Javascript Zeichenketten\"";
"JSSingleString" = "'Javascript Zeichenketten'";

"/Ruby/Literals" = "Literale";
"/Ruby/Attribute Definitions" = "Attributdefinitionen";
"/Ruby/Definitions" = "Definitionen";
"/Ruby/Keywords" = "Schlüsselwörter";
"/Ruby/Builtin Functions" = "Eingebaute Funktionen";
"/Ruby/Builtin Globals" = "Eingebaute Globals";
"/Ruby/Builtin Classes" = "Eingebaute Classes";
"/Ruby/Symbols" = ":symbole";
"/Ruby/Numbers" = "Zahlen";
"/Ruby/Instance Variables" = "Instanzvariablen";
"/Ruby/Class Variables" = "Klassenvariablen";
"/Ruby/Global Variables" = "globale Variablen";
"/Ruby/String with double quotes" = "\"Zeichenketten\"";
"/Ruby/test" = "Eingebettete Ausdrücke";
"/Ruby/String with single quotes" = "'Zeichenketten'";
"/Ruby/Backticks" = "`Backticks`";
"/Ruby/Singleline Comment" = "# Kommentar";
"/Ruby/Regexp" = "Reguläre Ausdrücke";
"/Ruby/POD Comments" = "POD Kommentare";
"/Ruby/HTML" = "HTML";
"/Ruby/Tags" = "HTML Tags";
"/Ruby/Attributes" = "HTML Attribute";
"/Ruby/Strings" = "HTML Zeichenketten";
"/Ruby/ERB Delimiter" = "<%ERB Delimiter%>";
"/Ruby/HTMLComment" = "<!-- Kommentar -->";
"/Ruby/Heredoc" = ">>HEREDOC Zeichenketten";
"/Ruby/Hexadecimal Characters" = "Hexadezimale Zeichen";

"/CSS/CSS Attributes" = "CSS Attribute";
"/CSS/CSS Keywords" = "CSS Schlüsselwörter";
"/CSS/CSS Digits" = "CSS Ziffern";
"/CSS/CSS Colors" = "CSS Farben";

"/Javascript/Keywords" = "Javascript Schlüsselwörter";
"/Javascript/Numbers" = "Javascript Zahlen";
"/Javascript/Characters" = "Javascript Zeichen";
"/Javascript/FunctionRegex" = "Javascript Funktionsaufrufe";

